ГТС/УТГТС/DataProcessors/ФорматДоговорнойДокумент101XML.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ФорматДоговорнойДокумент101XML</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ГТС/УТГТС/Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицоНеРезидент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ГТС/УТГТС/DataProcessors/ФорматДоговорнойДокумент101XML/Forms/ФормаСправкиПомощникПДФ_А3ДляЭД/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.ВыбранныйФайл) = Тип("Структура") Тогда
		Если Параметры.ВыбранныйФайл.Свойство("Хранение") Тогда
			ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(Параметры.ВыбранныйФайл.Хранение);
		ИначеЕсли Параметры.ВыбранныйФайл.Свойство("ДвоичныеДанные") Тогда
			ДвоичныеДанныеФайла = Параметры.ВыбранныйФайл.ДвоичныеДанные;
		КонецЕсли;
	Иначе
		ДанныеФайла = РаботаСФайлами.ДанныеФайла(Параметры.ВыбранныйФайл);
		ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);	
	КонецЕсли;
	
	ПараметрыФормыЭД = Параметры.ПараметрыФормыЭД;
	ВыбранныйФайл = Параметры.ВыбранныйФайл;
	
	Поток = ДвоичныеДанныеФайла.ОткрытьПотокДляЧтения();
	ДокументPDF.Прочитать(Поток); 
	
	ЗаполнитьДанныеДоговора();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ТипЗнч(ВыбранныйФайл) = Тип("Структура") Тогда
		Оповестить("РедактированиеФайлаЭДО",,ВыбранныйФайл);  
	КонецЕсли;

КонецПроцедуры

 
&НаКлиенте
Процедура ПриПовторномОткрытии() 
	
	Если Не ТипЗнч(ВыбранныйФайл) = Тип("Структура") Тогда
		Оповестить("РедактированиеФайлаЭДО",,ВыбранныйФайл);  
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ТипЗнч(ВыбранныйФайл) = Тип("Структура") Тогда
		Оповестить("ЗавершениеРедактированияФайлаЭДО",,ВыбранныйФайл);  
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_Файл" Тогда
		Если Не ЗначениеЗаполнено(Источник)
			Или (ТипЗнч(Источник) = Тип("Массив")
			И Источник.Количество() = 0) Тогда 
			Возврат;
		КонецЕсли;
		
		СсылкаНаФайл = ?(ТипЗнч(Источник) = Тип("Массив"), Источник[0], Источник);
		Если ТипЗнч(СсылкаНаФайл) <> Тип("СправочникСсылка.ДоговорыКонтрагентовПрисоединенныеФайлы") Тогда
			Возврат;
		КонецЕсли; 
		
		Событие = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметр, "Событие" , "");
		Если (Событие = "ФайлРедактировался" Или Событие = "ДанныеФайлаИзменены")
			И ТипЗнч(ВыбранныйФайл) <> Тип("Структура") И СсылкаНаФайл = ВыбранныйФайл Тогда
			ДанныеФайла = РаботаСФайламиКлиент.ДанныеФайла(СсылкаНаФайл);
			ДвоичныеДанныеФайла = ПолучитьИзВременногоХранилища(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла);	
			Поток = ДвоичныеДанныеФайла.ОткрытьПотокДляЧтения();
			ДокументPDF.Прочитать(Поток); 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Если Не ТипЗнч(ВыбранныйФайл) = Тип("Структура") Тогда
		ОсвободитьФайл();
		ОповеститьОбИзменении(ВыбранныйФайл);
		Оповестить("Запись_Файл", Новый Структура("Событие", "ДанныеФайлаИзменены"), ВыбранныйФайл);
		Оповестить("Запись_Файл", Новый Структура("Событие", "ФайлРедактировался"), ВыбранныйФайл);
	КонецЕсли;
	
	Закрыть(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДанныеДоговора()
	
	Если ТипЗнч(Параметры.ПараметрыФормыЭД) = Тип("Структура") Тогда   
		Договор = Параметры.ПараметрыФормыЭД.ОбъектУчета; 
	Иначе	
		Договор = Параметры.ПараметрыФормыЭД
	КонецЕсли;
	
	Данные = Справочники.ДоговорыКонтрагентов.ПолучитьДанныеДляЭД(Договор);
	Данные.Следующий();   
	
	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	Если ЗначениеЗаполнено(Данные.Номер) Тогда
		ТекстДанных = Нстр("ru = 'Номер договорного документа: '") + Данные.Номер;
	Иначе 
		ТекстДанных = Нстр("ru = 'Номер договорного документа: без номера (б/н)'");
	КонецЕсли;
	Если ЗначениеЗаполнено(Данные.Дата) Тогда
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = 'Дата договорного документа: '") + Данные.Дата;
	Иначе 
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = 'Дата договорного документа: без даты'");
	КонецЕсли; 	
	ТекстДанных = ТекстДанных + " 
	|"+ Нстр("ru = 'Тип договорного документа: '") + Данные.ТипДоговора;	
	
	ТекстДанных = ТекстДанных + " 
	|" + Нстр("ru = 'Идентификационные сведения об организации:'");
	СторонаОрганизация = ЭлектронноеВзаимодействиеУТ.ПолучитьДанныеЮрФизЛица(Данные.Организация, 
		Данные.БанковскийСчет, Данные.Дата); 
		
	Если Данные.Организация_ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = 'o Сведения об индивидуальном предпринимателе:'");

		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = '  •	Краткое название: '") + СторонаОрганизация.СокращенноеНаименование;		
		Если ЗначениеЗаполнено(СторонаОрганизация.КодПоОКПО) Тогда
			ТекстДанных = ТекстДанных + " 
			|" + Нстр("ru = '  •	Код по ОКПО: '") + СторонаОрганизация.КодПоОКПО;
		КонецЕсли; 
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = '  •	ИНН: '") + СторонаОрганизация.ИНН; 
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = '  •	ОГРН ИП: '") + СторонаОрганизация.ОГРН;
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = '  •	Фамилия: '") + СторонаОрганизация.Фамилия;
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = '  •	Имя: '") + СторонаОрганизация.Имя; 
		Если ЗначениеЗаполнено(СторонаОрганизация.Отчество) Тогда
			ТекстДанных = ТекстДанных + " 
			|" + Нстр("ru = '  •	Отчество: '") + СторонаОрганизация.Отчество;
		КонецЕсли;
	ИначеЕсли Данные.Организация_ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = 'o Сведения об юридическом лице:'");

		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = '  •	Краткое название: '") + СторонаОрганизация.СокращенноеНаименование;
		Если ЗначениеЗаполнено(СторонаОрганизация.КодПоОКПО) Тогда
			ТекстДанных = ТекстДанных + " 
			|" + Нстр("ru = 'Код по ОКПО: '") + СторонаОрганизация.КодПоОКПО;
		КонецЕсли; 
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = '  •	Наименование полное: '") + СторонаОрганизация.ПолноеНаименование;
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = '  •	ИНН: '") + СторонаОрганизация.ИНН;
		Если ЗначениеЗаполнено(СторонаОрганизация.ОГРН) Тогда
			ТекстДанных = ТекстДанных + " 
			|" + Нстр("ru = '  •	ОГРН: '") + СторонаОрганизация.ОГРН;
		КонецЕсли;  
		Если ЗначениеЗаполнено(СторонаОрганизация.КПП) Тогда
			ТекстДанных = ТекстДанных + " 
			|" + Нстр("ru = '  •	КПП: '") + СторонаОрганизация.КПП;
		КонецЕсли; 
	КонецЕсли;

	Обработка = Обработки.ФорматДоговорныйДокумент101.Создать();

	ТекстДанных = ТекстДанных + " 
	|" + Нстр("ru = 'o Адрес организации:'"); 
	Адрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
			Данные.Организация, 
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации), 
			Данные.Дата, Ложь);	
			
	АдресЗначение = "";
	Если ЗначениеЗаполнено(Адрес) Тогда
		АдресЗначение = Адрес[0].Представление;
	КонецЕсли;		
	ТекстДанных = ТекстДанных + " 
	|" + Нстр("ru = '  •	'") + АдресЗначение;
	
	Если ЗначениеЗаполнено(СторонаОрганизация.Телефоны) ИЛИ ЗначениеЗаполнено(СторонаОрганизация.ЭлектроннаяПочта) Тогда
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = 'o Контактные данные организации:'"); 
		Если ЗначениеЗаполнено(СторонаОрганизация.Телефоны) Тогда
			ТекстДанных = ТекстДанных + " 
			|" + Нстр("ru = '  •	Телефон: '") + СторонаОрганизация.Телефоны;
		КонецЕсли;  
		Если ЗначениеЗаполнено(СторонаОрганизация.ЭлектроннаяПочта) Тогда
			ТекстДанных = ТекстДанных + " 
			|" + Нстр("ru = '  •	Электронная почта: '") + СторонаОрганизация.ЭлектроннаяПочта;
		КонецЕсли; 
	КонецЕсли;
		
	ТекстДанных = ТекстДанных + " 
	|" + Нстр("ru = 'o Банковские реквизиты организации:'");
	Если ЗначениеЗаполнено(Данные.Организация_БанковскийСчет_ИНН) Тогда
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = '  •	ИНН банка: '") + Данные.Организация_БанковскийСчет_ИНН;
	КонецЕсли;
	ТекстДанных = ТекстДанных + " 
	|" + Нстр("ru = '  •	Расчетный счет: '") + Данные.Организация_БанковскийСчет_НомерСчета;
	Если ЗначениеЗаполнено(Данные.Организация_БанковскийСчет_НаименованиеБанка) Тогда
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = '  •	Наименование банка: '") + Данные.Организация_БанковскийСчет_НаименованиеБанка;
	КонецЕсли;
	ТекстДанных = ТекстДанных + " 
	|" + Нстр("ru = '  •	БИК банка: '") + Данные.Организация_БанковскийСчет_БИК;
	ТекстДанных = ТекстДанных + " 
	|" + Нстр("ru = '  •	Корреспондентский счет: '") + Данные.Организация_БанковскийСчет_КоррСчет;
	
	ТекстДанных = ТекстДанных + " 
	|" + Нстр("ru = 'Идентификационные сведения о контрагенте:'");
	СторонаКонтрагент = ЭлектронноеВзаимодействиеУТ.ПолучитьДанныеЮрФизЛица(Данные.Контрагент, 
		Данные.БанковскийСчетКонтрагента, Данные.Дата);
		
	Если Данные.Контрагент_ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда		
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = 'o Сведения об индивидуальном предпринимателе:'");

		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = '  •	Краткое название: '") + СторонаКонтрагент.СокращенноеНаименование;		
		Если ЗначениеЗаполнено(СторонаКонтрагент.КодПоОКПО) Тогда
			ТекстДанных = ТекстДанных + " 
			|" + Нстр("ru = '  •	Код по ОКПО: '") + СторонаКонтрагент.КодПоОКПО;
		КонецЕсли; 
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = '  •	ИНН: '") + СторонаКонтрагент.ИНН; 
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = '  •	ОГРН ИП: '") + СторонаКонтрагент.ОГРН;
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = '  •	Фамилия: '") + СторонаКонтрагент.Фамилия;
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = '  •	Имя: '") + СторонаКонтрагент.Имя; 
		Если ЗначениеЗаполнено(СторонаКонтрагент.Отчество) Тогда
			ТекстДанных = ТекстДанных + " 
			|" + Нстр("ru = '  •	Отчество: '") + СторонаКонтрагент.Отчество;
		КонецЕсли;
	ИначеЕсли Данные.Контрагент_ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = 'o Сведения об юридическом лице:'");

		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = '  •	Краткое название: '") + СторонаКонтрагент.СокращенноеНаименование;		
		Если ЗначениеЗаполнено(СторонаКонтрагент.КодПоОКПО) Тогда
			ТекстДанных = ТекстДанных + " 
			|" + Нстр("ru = 'Код по ОКПО: '") + СторонаКонтрагент.КодПоОКПО;
		КонецЕсли; 
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = '  •	Наименование полное: '") + СторонаКонтрагент.ПолноеНаименование;
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = '  •	ИНН: '") + СторонаКонтрагент.ИНН;
		Если ЗначениеЗаполнено(СторонаКонтрагент.ОГРН) Тогда
			ТекстДанных = ТекстДанных + " 
			|" + Нстр("ru = '  •	ОГРН: '") + СторонаКонтрагент.ОГРН;
		КонецЕсли;  
		Если ЗначениеЗаполнено(СторонаКонтрагент.КПП) Тогда
			ТекстДанных = ТекстДанных + " 
			|" + Нстр("ru = '  •	КПП: '") + СторонаКонтрагент.КПП;
		КонецЕсли; 
	ИначеЕсли Данные.Контрагент_ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент Тогда
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = '  •	Наименование полное: '") + СторонаКонтрагент.ПолноеНаименование;
		КодСтраны = Обработка.ЗаполнитьКодСтраныИностранногоАдреса(Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента,
				Данные.Контрагент, Данные.Дата, Обработка);
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = '  •	Код страны: '") + КодСтраны;
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = '  •	Регистрационный номер: '") + Данные.Контрагент_ИдентификаторЮридическогоЛица;
	ИначеЕсли Данные.Контрагент_ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = '  •	ИНН: '") + СторонаКонтрагент.ИНН;
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = '  •	Фамилия: '") + СторонаКонтрагент.Фамилия;
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = '  •	Имя: '") + СторонаКонтрагент.Имя; 
		Если ЗначениеЗаполнено(СторонаКонтрагент.Отчество) Тогда
			ТекстДанных = ТекстДанных + " 
			|" + Нстр("ru = '  •	Отчество: '") + СторонаКонтрагент.Отчество;
		КонецЕсли;
	КонецЕсли;

	ТекстДанных = ТекстДанных + " 
	|" + Нстр("ru = 'o Адрес контрагента:'"); 
	Адрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
			Данные.Контрагент, 
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента), 
			Данные.Дата, Ложь);	
			
	АдресЗначение = "";
	Если ЗначениеЗаполнено(Адрес) Тогда
		АдресЗначение = Адрес[0].Представление;
	КонецЕсли;		
	ТекстДанных = ТекстДанных + " 
	|" + Нстр("ru = '  •	'") + АдресЗначение;	
		
	Если ЗначениеЗаполнено(СторонаКонтрагент.Телефоны) ИЛИ ЗначениеЗаполнено(СторонаКонтрагент.ЭлектроннаяПочта) Тогда
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = 'o Контактные данные контрагента:'"); 
		Если ЗначениеЗаполнено(СторонаКонтрагент.Телефоны) Тогда
			ТекстДанных = ТекстДанных + " 
			|" + Нстр("ru = '  •	Телефон: '") + СторонаКонтрагент.Телефоны;
		КонецЕсли;  
		Если ЗначениеЗаполнено(СторонаКонтрагент.ЭлектроннаяПочта) Тогда
			ТекстДанных = ТекстДанных + " 
			|" + Нстр("ru = '  •	Электронная почта: '") + СторонаКонтрагент.ЭлектроннаяПочта;
		КонецЕсли; 
	КонецЕсли;
		
	ТекстДанных = ТекстДанных + " 
	|" + Нстр("ru = 'o Банковские реквизиты организации:'");
	Если ЗначениеЗаполнено(Данные.Контрагент_БанковскийСчет_ИНН) Тогда
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = '  •	ИНН банка: '") + Данные.Контрагент_БанковскийСчет_ИНН;
	КонецЕсли;
	ТекстДанных = ТекстДанных + " 
	|" + Нстр("ru = '  •	Расчетный счет: '") + Данные.Контрагент_БанковскийСчет_НомерСчета;
	Если ЗначениеЗаполнено(Данные.Контрагент_БанковскийСчет_НаименованиеБанка) Тогда
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = '  •	Наименование банка: '") + Данные.Контрагент_БанковскийСчет_НаименованиеБанка;
	КонецЕсли;
	ТекстДанных = ТекстДанных + " 
	|" + Нстр("ru = '  •	БИК банка: '") + Данные.Контрагент_БанковскийСчет_БИК;
	ТекстДанных = ТекстДанных + " 
	|" + Нстр("ru = '  •	Корреспондентский счет: '") + Данные.Контрагент_БанковскийСчет_КоррСчет;	
	
	ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = 'Сумма договора: '") + Данные.Сумма;
	Если ЗначениеЗаполнено(Данные.Валюта_Наименование) Тогда
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = 'Валюта: '") + Данные.Валюта_Наименование;
	КонецЕсли;	
	Если ЗначениеЗаполнено(Данные.ПорядокРасчетов) Тогда
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = 'Детализация расчетов: '") + Данные.ПорядокРасчетов;
	КонецЕсли;  
	Если ЗначениеЗаполнено(Данные.СрокОплаты) Тогда 
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = 'Срок оплаты: долгосрочная (больше 365 дней)'");
	Иначе
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = 'Срок оплаты: краткосрочная '");
	КонецЕсли;
	Если ЗначениеЗаполнено(Данные.ДатаНачалаДействия) Тогда
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = 'Дата начала действия: '") + Данные.ДатаНачалаДействия;
	КонецЕсли;
	Если ЗначениеЗаполнено(Данные.ДатаНачалаДействия) Тогда
		ТекстДанных = ТекстДанных + " 
		|" + Нстр("ru = 'Дата окончания действия: '") + Данные.ДатаОкончанияДействия;
	КонецЕсли;
	
	ДанныеДоговора = ТекстДанных;
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

КонецПроцедуры

&НаСервере
Процедура ОсвободитьФайл()
	
	Если ЗначениеЗаполнено(ВыбранныйФайл.Редактирует) 
		И ВыбранныйФайл.Редактирует = Пользователи.ТекущийПользователь() Тогда 
		НачатьТранзакцию();
		Попытка
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить(Метаданные.НайтиПоТипу(ТипЗнч(ВыбранныйФайл)).ПолноеИмя());
			ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", ВыбранныйФайл);
			БлокировкаДанных.Заблокировать();
			
			ФайлОбъект = ВыбранныйФайл.Ссылка.ПолучитьОбъект();
			
			ЗаблокироватьДанныеДляРедактирования(ФайлОбъект.Ссылка, , УникальныйИдентификатор);
			ФайлОбъект.Редактирует = Справочники.Пользователи.ПустаяСсылка();
			ФайлОбъект.ДатаЗаема = Дата("00010101000000");
			ФайлОбъект.Записать();
			
			РаботаСФайламиПереопределяемый.ПриОсвобожденииФайла(ВыбранныйФайл, УникальныйИдентификатор);
			РазблокироватьДанныеДляРедактирования(ВыбранныйФайл, УникальныйИдентификатор);
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			РазблокироватьДанныеДляРедактирования(ВыбранныйФайл, УникальныйИдентификатор);
			ВызватьИсключение;
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
